chattr_artillery.yml
config:
  target: https://www.chattr.projectpeng.win
  # target: http://127.0.0.1:8000
  payload:
    - path: "./load_testing/accounts_tokens.csv"
      fields:
        - "token"
      order: sequence
      skipHeader: true
  phases:
    - duration: 30
      arrivalRate: 1
      rampTo: 5
      name: Warm up phase
    # - duration: 60
    #   arrivalRate: 5
    #   rampTo: 10
    #   name: Ramp up load
    # - duration: 30
    #   arrivalRate: 10
    #   rampTo: 30
    #   name: Spike phase
  plugins:
    apdex: {}
    metrics-by-endpoint: {}
  apdex:
    threshold: 100
scenarios:
  - name: "WebSocket scenario"
    flow:
    - engine: "ws"
    #   # - log: "Getting auth token"
    #   # - log: "username: {{ username }} password: {{ password }}"
    #   - post:
    #       url: "/auth/token"
    #       form:
    #         username: "{{ username }}"
    #         password: "{{ password }}"
    #       capture:
    #         - json: "$.access_token"
    #           as: "token"
      # - log: "Token received: {{ token }}"
      #
      # - log: "Connecting to WebSocket with token: {{ token }}"
    - ws:
        # url: "ws://127.0.0.1:8000/ws"
      - log: "Bearer {{ token }}"
        url: "wss://www.chattr.projectpeng.win/ws"
        headers:
          Authorization: "Bearer {{ token }}"
    - loop:
        - send: '{"event": "message", "channel": "test_0", "content": "Artillery incoming!",}'
        - think:  1 # Wait for 2 seconds
      count: 30 # Repeat sending message 30 times
    - ws:
        close: true
#! Run commands:
# cd into directory with .yml file with no logging
# artillery run chattr_artillery.yml